app/Controllers/MedicamentosController.php

    public function create(): string
    {
        $medicamentoModel = new MedicamentoModel();
        $tipoProductoModel = new TipoProductoModel();
        $medidaModel = new MedidaProductoModel();

        $medicamentos = $medicamentoModel->findAll();
        $tiposProductos = $tipoProductoModel->findAll();
        $unidadesMedida = $medidaModel->findAll();
---
SELECT *
FROM `medicamento`
SELECT *
FROM `tipo_producto`
SELECT *
FROM `medida_producto`

    public function update(): string
    {
        $medicamentoModel = new MedicamentoModel();
        $productoModel = new ProductoFarmaceuticoModel();
        $tipoProductoModel = new TipoProductoModel();
        $medidaModel = new MedidaProductoModel();

        $tiposProductos = $tipoProductoModel->findAll();
        $unidadesMedida = $medidaModel->findAll();
        $medicamentos = $medicamentoModel->findAll();
        $productos = $productoModel->findAll();
---
SELECT *
FROM `tipo_producto`
SELECT *
FROM `medida_producto`
SELECT *
FROM `medicamento`
SELECT *
FROM `producto_farmaceutico`

    public function delete(): string
    {
        $medicamentoModel = new MedicamentoModel();

        $medicamentos = $medicamentoModel->findAll();
---
SELECT *
FROM `medicamento`