app/Models/MedicamentoModel.php

    public function obtenerTodos(): array
    {
        $registros = $this->where('activo_medicamento', 1)
            ->orderBy('nombre_medicamento', 'ASC')
            ->findAll();
---
SELECT *
FROM `medicamento`
WHERE `activo_medicamento` = 1
ORDER BY `nombre_medicamento` ASC