app/Models/MedidaProductoModel.php

    public function obtenerTodos(): array
    {
        $registros = $this->orderBy('nombre_medida', 'ASC')->findAll();
---
SELECT *
FROM `medida_producto`
ORDER BY `nombre_medida` ASC