app/Models/ProductoFarmaceuticoModel.php

    public function obtenerProductosPorMedicamento(int $idMedicamento): array
    {
        $builder = $this->db->table('producto_farmaceutico pf');//Crea la consulta sobre la tabla especificada
        $builder->join('medicamento m', 'm.id_medicamento = pf.id_medicamento');//Se hace el JOIN con la tabla medicamento
        $builder->join('tipo_producto tp', 'tp.id_tipo_producto = pf.id_tipo_producto');//Se hace el JOIN con la tabla tipo producto
        $builder->join('medida_producto mp', 'mp.id_medida_producto = pf.id_medida_producto');//Se hace el JOIN con la tabla medida producto
        $builder->where('pf.id_medicamento', $idMedicamento);

        return $builder->get()->getResult();
---
SELECT *
FROM `producto_farmaceutico` `pf`
JOIN `medicamento` `m` ON `m`.`id_medicamento` = `pf`.`id_medicamento`
JOIN `tipo_producto` `tp` ON `tp`.`id_tipo_producto` = `pf`.`id_tipo_producto`
JOIN `medida_producto` `mp` ON `mp`.`id_medida_producto` = `pf`.`id_medida_producto`
WHERE `pf`.`id_medicamento` = 1