app/Models/TipoProductoModel.php

SELECT *
FROM `tipo_producto`
ORDER BY `nombre_tipo_producto` ASC
---
    public function obtenerTodos(): array
    {
        $registros = $this->orderBy('nombre_tipo_producto', 'ASC')->findAll();